angular.module('LmbCityModule', []).factory('Regions', [function () {

    var cities = {};
    cities['澳门'] = ['澳门'];
    cities['香港'] = ['香港'];
    cities['台湾'] = ['台北市', '基隆市', '高雄市', '台中', '台南', '新北市', '新竹市', '嘉义市'];
    cities['海南省'] = ['儋州市', '东方市', '海口市', '琼海市', '三亚市', '文昌市', '五指山', '万宁'];
    cities['河北省'] = ['保定市', '沧州市', '承德市', '邯郸市', '衡水市', '廊坊市', '秦皇岛市', '石家庄市', '唐山市', '邢台市', '张家口市'];
    cities['河南省'] = ['安阳市', '鹤壁市', '焦作市', '开封市', '漯河市', '洛阳市', '南阳市', '平顶山市', '濮阳市', '三门峡市', '商丘市', '新乡市', '信阳市', '许昌市', '郑州市', '周口市', '驻马店市', '济源市'];
    cities['黑龙江省'] = ['大庆市', '大兴安岭地区', '哈尔滨市', '鹤岗市', '黑河市', '鸡西市', '佳木斯市', '牡丹江市', '七台河市', '齐齐哈尔市', '双鸭山市', '绥化市', '伊春市'];
    cities['湖北省'] = ['鄂州市', '恩施市', '黄冈市', '黄石市', '荆门市', '荆州市', '潜江市', '神农架林区', '十堰市', '随州市', '天门市', '武汉', '仙桃市', '咸宁市', '襄樊市', '孝感市', '宜昌市'];
    cities['湖南省'] = ['常德市', '郴州市', '衡阳市', '怀化市', '娄底市', '邵阳市', '湘潭市', '湘西土家族苗族自治州', '益阳市', '永州市', '岳阳市', '张家界市', '长沙市', '株洲市'];
    cities['吉林省'] = ['白城市', '白山市', '吉林市', '辽源市', '四平市', '松原市', '通化市', '延边朝鲜族自治州', '长春市'];
    cities['江苏省'] = ['常州市', '淮安市', '连云港市', '南京市', '南通市', '苏州市', '泰州市', '无锡市', '宿迁市', '徐州市', '盐城市', '扬州市', '镇江市'];
    cities['江西省'] = ['抚州市', '赣州市', '吉安市', '景德镇市', '九江市', '南昌市', '萍乡市', '上饶市', '新余市', '宜春市', '鹰潭市'];
    cities['辽宁省'] = ['鞍山市', '本溪市', '朝阳市', '大连市', '丹东市', '抚顺市', '阜新市', '葫芦岛市', '锦州市', '辽阳市', '盘锦市', '沈阳市', '铁岭市', '营口市'];
    cities['内蒙古省'] = ['阿拉善盟', '巴彦淖尔市', '包头市', '赤峰市', '鄂尔多斯市', '呼和浩特市', '呼伦贝尔市', '通辽市', '乌海市', '乌兰察布市', '锡林郭勒盟', '兴安盟'];
    cities['宁夏'] = ['固原市', '石嘴山市', '吴忠市', '银川市', '中卫市'];
    cities['青海省'] = ['海东地区', '海西蒙古族藏族自治州', '西宁市', '玉树藏族自治州', '海南藏族自治州'];
    cities['山东省'] = ['滨州市', '德州市', '东营市', '菏泽市', '济南市', '济宁市', '莱芜市', '聊城市', '临沂市', '青岛市', '日照市', '泰安市', '威海市', '潍坊市', '烟台市', '枣庄市', '淄博市'];
    cities['山西省'] = ['大同市', '晋城市', '晋中市', '临汾市', '吕梁市', '朔州市', '太原市', '忻州市', '阳泉市', '运城市', '长治市'];
    cities['陕西省'] = ['安康市', '宝鸡市', '汉中市', '商洛市', '铜川市', '渭南市', '西安市', '咸阳市', '延安市', '榆林市'];
    cities['四川省'] = ['阿坝藏族羌族自治州', '巴中市', '成都市', '达州市', '德阳市', '甘孜藏族自治州', '广安市', '广元市', '乐山市', '凉山彝族自治州', '泸州市', '眉山市', '绵阳市', '南充市', '内江市', '攀枝花市', '遂宁市', '雅安市', '宜宾市', '资阳市', '自贡市'];
    cities['西藏'] = ['拉萨市', '林芝地区', '那曲地区', '日喀则地区', '昌都市'];
    cities['新疆'] = ['阿克苏地区', '阿勒泰市', '巴音郭楞蒙古自治州', '博尔塔拉蒙古自治州', '昌吉回族自治州', '哈密市', '和田市', '喀什市', '克拉玛依市', '石河子市', '塔城市', '吐鲁番市', '乌鲁木齐市', '伊犁市', '克孜勒苏柯尔克孜', '五家渠'];
    cities['云南省'] = ['保山市', '楚雄市', '大理市', '德宏傣族景颇族自治州', '红河哈尼族彝族自治州', '昆明市', '丽江市', '临沧市', '普洱市', '曲靖市', '文山市', '玉溪市', '昭通市', '怒江傈僳族自治州', '迪庆藏族自治州', '西双版纳傣族自治州'];
    cities['浙江省'] = ['杭州市', '湖州市', '嘉兴市', '金华市', '丽水市', '宁波市', '衢州市', '绍兴市', '台州市', '温州市', '舟山市'];

    //return cities;
    return [
        {
            name: '北京',
            cities: []
        },{
            name:'天津',
            cities:[]
        },{
            name:'上海',
            cities:[]
        },{
            name:'重庆',
            cities:[]
        },{
            name:'安徽省',
            cities:['安庆市', ' 蚌埠市', ' 亳州市', '池州市', '滁州市', '阜阳市', '合肥市', '淮北市', '淮南市', '黄山市', '六安市', '马鞍山市', '铜陵市', '芜湖市', '宿州市', '宣城市']
        },{
            name:'福建省',
            cities:['福州市', '龙岩市', '南平市', '宁德市', '莆田市', '泉州市', '三明市', '厦门市', '漳州市']
        },{
            name:'甘肃省',
            cities:['白银市', '定西市', '嘉峪关市', '金昌市', '酒泉市', '兰州市', '临夏回族自治州', '陇南市', '平凉市', '庆阳市', '天水市', '武威市', '张掖市', '甘南市']
        },{
            name:'广东省',
            cities:['潮州市', '东莞市', '佛山市', '广州市', '河源市', '惠州市', '江门市', '揭阳市', '茂名市', '梅州市', '清远市', '汕头市', '汕尾市','韶关市', '深圳市', '阳江市', '云浮市', '湛江市', '肇庆市', '中山市', '珠海市']
        },{
            name:'广西',
            cities:['百色市', '北海市', '防城港市', '贵港市', '桂林市', '河池市', '贺州市', '来宾市', '柳州市', '南宁市', '钦州市', '梧州市', '玉林市', '崇左市']
        },{
            name:'贵州省',
            cities:['安顺市', '毕节市', '贵阳市', '六盘水市', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '黔西南布依族苗族自治州', '铜仁市']
        }
    ]
}]).directive('lmbCitySelector', ['Regions', function (Regions) {
    return {
        restrict: 'A',
        replace: true,
        template: '<div class="lmb-city-selector">' +
            '<ul>' +
                '<li ng-repeat="region in regions">{{region.name}}' +
                    '<ul ng-if="region.cities.length">' +
                        '<li ng-repeat="city in region.cities">{{city}}</li>' +
                    '</ul>' +
                '</li>' +
            '</ul>' +
        '</div>',
        link: function (scope, elem, attr) {
            //console.log('Cities：', Cities);
            scope.regions = Regions;
        }
    }
}]);
